# Manipulação de Dados ausente

In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'A': [1,2,np.nan], 'B': [1,2,np.nan], 'C': [1,2,np.nan]})

In [4]:
df

     A    B    C
0  1.0  1.0  1.0
1  2.0  2.0  2.0
2  NaN  NaN  NaN

In [5]:
df.dropna(axis=0)

     A    B    C
0  1.0  1.0  1.0
1  2.0  2.0  2.0

In [6]:
df.dropna(axis=0, thresh=2)

     A    B    C
0  1.0  1.0  1.0
1  2.0  2.0  2.0